# GetOptions Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
LinkConversionData..::..GetOptions Method
LinkConversionData Class See Also
---
Extra information used during the creation of the Revit document.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public IDictionary<string, string> GetOptions()
```

Visual Basic
---
```text
Public Function GetOptions As IDictionary(Of String, String)
```

Visual C++
---
```text
public:
IDictionary<String^, String^>^ GetOptions()
```

# ### Return Value
The extra information used during the creation of the Revit document.
# See Also
LinkConversionData Class
Autodesk.Revit.DB Namespace